finalDramaRules = ['Криминальная драма', 'Историческая драма', 'Подростковая драма', 'Психологическая драма', 'Мелодрама'] 
finalActionRules = ['Пеплумы', 'Фильмы про викингов', 'Фильмы про рыцарей', 'Вестерны', 'Фильмы про гангстеров', 'Военная научная фантастика']
finalFantasticRules = ['Space opera', 'Киберпанк', 'Фильмы про пришельцев', 'Фэнтези', 'Фильмы про вампиров', 'Фильмы про зомби']
finalComedyRules = ['Комедия ужасов', 'Романтическая комедия', 'Комедия ситуаций', 'Музыкальная комедия', 'Трагикомедия']

FinalRules = {
    'Комедия': finalComedyRules,
    'Драма' : finalDramaRules,
    'Боевик': finalActionRules,
    'Фантастика': finalFantasticRules,
}

FilmSamples = {
    'Криминальная драма' : ['Крестный отец', 'Побег из Шоушенка', 'Ирландец'],
    'Историческая драма' : ['Список Шиндлера', 'По соображениям совести', 'Тёмные времена'],
    'Подростковая драма' : ['Виноваты звёзды', 'Общество мертвых поэтов', 'Жизнь Пи'],
    'Психологическая драма' : ['Пролетая над гнездом кукушки', 'Одержимость', 'Манчестер у моря', 'Джокер'],
    'Мелодрама' : ['Ла-ла лэнд', 'Любовь и голуби', 'Вселенная Стивена Хокинга'],
    'Пеплумы' : ['Гладиатор', 'Спартак', 'Троя', '300 спартанцев'],
    'Фильмы про викингов' : ['Тринадцатый воин', 'Викинги', 'Беовульф'],
    'Фильмы про рыцарей' : ['Последние рыцари', 'Царство небесное', 'История рыцаря'],
    'Вестерны' : ['Хороший, плохой, злой', 'Тумстоун', 'Омерзительная восьмёрка'],
    'Фильмы про гангстеров' : ['Самый пьяный округ в мире', 'Джентельмены', 'Рок-н-рольщик'],
    'Военная научная фантастика' : ['Звездный десант', 'Игра Эндера', 'Дюна'],
    'Space opera' : ['Звездные войны', 'Стартрек', 'Серенити'],
    'Киберпанк' : ['Бегущий по лезвию', 'Матрица', 'Призрак в доспехах'],
    'Фильмы про пришельцев' : ['Война миров', 'Люди в чёрном', 'День независимости'],
    'Фэнтези' : ['Властелин колец', 'Хроники Нарнии', 'Варкрафт'],
    'Фильмы про вампиров' : ['Дракула', 'Интервью с вампиром', 'Другой мир'],
    'Фильмы про зомби' : ['Я - легенда', '28 дней спустя', 'Ходячие мертвецы'],
    'Комедия ужасов': ['Добро пожаловать в Зомбиленд', 'Очень страшное кино', 'Операция Мертвый снег'],
    'Романтическая комедия' : ['Огни большого города', 'За бортом', 'Почему он'],
    'Комедия ситуаций' : ['Ирония судьбы или С легким паром!', 'День сурка', 'Крысиные бега'],
    'Музыкальная комедия' : ['В джазе только девушки', 'Черная кошка', 'белый кот', 'Школа рока'],
    'Трагикомедия' : ['Зеленая книга', 'Жизнь прекрасна', 'Еще по одной', 'Бердмен'],
}
